controllers/ClientController.php

INSERT INTO `client` (`title`, `phone`, `email`, `comment`) VALUES ('Umid', '5656565656', 'dsdsds@dsdsd.sd', 'dsdsdsd')
---
    public function actionCreate()
    {
        $model = new Client();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `client` WHERE `id`='2'
---
    protected function findModel($id)
    {
        if (($model = Client::findOne($id)) !== null) {