controllers/CustomerController.php

    public function actionCreate()
    {
        $first = new Customer();
        $model = [new Customer];
        if ($first->load(Yii::$app->request->post())) {
            $model = Model::createMultiple(Customer::classname());
---
INSERT INTO `customer` (`product_id`, `count`, `client_id`, `date_sale`, `price_sale`, `total_sum`) VALUES (1, 5000, 2, '2018-01-13', '15600', '78000000')