views/product/index.php

SELECT * FROM `category`
---
                    return Html::img('../' . $data->category->img,
                        ['width' => '60px']);
                },
                'filter' => ArrayHelper::map(app\models\Category::find()->all(),'id','img')

SELECT * FROM `gender`
SELECT * FROM `material` WHERE `id`=1
---
                'content'=>function($data){
                    return  $data->getGenderName();
                },
                'filter' => ArrayHelper::map(app\models\Gender::find()->all(),'id','title')
            ],
            [
                'attribute'=>'material_id',
                'value'=> 'material.title',
                /*'format'=>'text', // Возможные варианты: raw, html
                'content'=>function($data){
                    return  $data->getMaterialName();
                },
                'filter' => ArrayHelper::map(app\models\Material::find()->all(),'id','title')*/
            ],