views/customer/_form.php

SELECT * FROM `client`
---
    <?php $form = ActiveForm::begin(['id' => 'dynamic-form']); ?>


        <?= $form->field($first, 'client_id')->widget(Select2::classname(), [
                                            'data' => ArrayHelper::map(\app\models\Client::find()->asArray()->all(), 'id','title'),
                                            'language' => 'en',
                                            'options' => ['placeholder' => 'Клиент'],
                                            'pluginOptions' => [
                                                'allowClear' => true

                                            ],
                                        ]) ?>

SELECT * FROM `category`
---
                            <div class="panel-body">
                                <div class="row">
                                    <div class="col-sm-4">
                                        <?= $form->field($modelAddress, "[{$i}]product_id")->widget(Select2::classname(), [
                                            'data' => ArrayHelper::map(\app\models\Category::find()->all(), 'id','title'),
                                            'language' => 'en',
                                            'options' => ['placeholder' => 'Select'],
                                            'pluginOptions' => [
                                                'allowClear' => true

                                            ],
                                        ]) ?>