views/customer/index.php

                </div><!-- /.box-header -->
                <div class="box-body table-responsive no-padding">
                    <div class="box-body">
    <?= GridView::widget([
        'dataProvider' => $dataProvider,
        'filterModel' => $searchModel,
        'columns' => [
            ['class' => 'yii\grid\SerialColumn'],

            [
                'attribute' => 'client_id',
                'value' => 'client.title',
                'filter' => Select2::widget([
                    'model' => $searchModel,
                    'attribute' => 'client_id',
                    'data' => ArrayHelper::map(\app\models\Client::find()->where(['status' => 1])->all(), 'id', 'title'),
                    //'theme' => Select2::THEME_BOOTSTRAP,
                    //'hideSearch' => true,
                    'options' => [
                        'placeholder' => Yii::t('app', 'Select'),
                    ]
                ]),
            ],
            [
                'attribute' => 'product_id',
                'value' => 'category.title',
                'filter' => Select2::widget([
                    'model' => $searchModel,
                    'attribute' => 'product_id',
                    'data' => ArrayHelper::map(\app\models\Category::find()->all(), 'id', 'title'),
                    //'theme' => Select2::THEME_BOOTSTRAP,
                    //'hideSearch' => true,
                    'options' => [
                        'placeholder' => Yii::t('app', 'Select'),
                    ],
                    'pluginOptions' => [
                        'width' => '400px',
                    ],
                ]),
            ],
---
SELECT * FROM `client` WHERE `id`=1
SELECT * FROM `client` WHERE `status`=1
SELECT * FROM `category`