models/Profit.php

SELECT * FROM `product` WHERE `date` BETWEEN '2018-01-09' AND '2018-01-10' ORDER BY `date`
---
    public function form($select)
    {

        //product
        if ($select == 1) {
            $model = Product::find()->where(['between', 'date', $this->date1, $this->date2])->orderBy(['date' => SORT_ASC])->all();